posts/20240104-forward-backward/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-18 Sat 20:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Zero-Shot RL with the Forward-Backward Representation, Inside Out</title>
<meta name="author" content="Harley Wiltzer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../assets/css/pandoc.css" />
<link rel="stylesheet" type="text/css" href="../../assets/css/navbar.css" />

</head>
<body>
<div id="content" class="content">
<div class="header-navbar" id="org6646e0f">
<ul class="org-ul">
<li><a href="../.././index.html">Home</a></li>
<li><a href="../.././about">About</a></li>
</ul>
<hr />

</div>

<div id="outline-container-org6b91a6b" class="outline-2">
<h2 id="org6b91a6b">Zero-Shot RL with the Forward-Backward Representation, Inside Out</h2>
<div class="outline-text-2" id="text-org6b91a6b">
<p>
In 2021, shortly after I started graduate school, Ahmed Touati and
Yann Ollivier published <a href="https://arxiv.org/abs/2103.07945">Learning One Representation to Optimize All
Rewards</a>, and this paper blew my mind. As the title suggests, the
paper presents an algorithm for learning a representation (the
<i>forward-backward representation</i>) that, in a
sense, encodes all possible optimal policies for a given MDP
simultaneously. You can see for yourself that this essentially does
work by playing around with their fabulous <a href="https://controllable-agent.metademolab.com/">demo</a>, where you can
literally prompt their model with a reward function and watch it
(nearly instantly) derive a Walker policy that optimizes the return.
</p>

<p>
The idea and the math behind the FB always seemed fairly magical to
me. Recently, I derived the FB "inside-out" (relative to the
exposition in the paper), which led to some nice intuitions and
insights, which I will document here.
</p>
</div>

<div id="outline-container-org04be52a" class="outline-3">
<h3 id="org04be52a">The Inside Out Derivation</h3>
<div class="outline-text-3" id="text-org04be52a">
<p>
One way to achieve zero-shot transfer in RL &#x2013; that is, immediately
inferring an optimal policy in an arbitrary (but Markovian) task &#x2013; is
by modeling the successor measure (SM, defined <a href="#orgf903f97">below</a> for completeness)
for each optimal policy. Before
FB, it was not clear how to do this, but in an ideal world where this
could be done, we can imagine modeling this object as \(M^{\pi^\star_r}(\cdot\mid
x, a)\)
&#x2013; that is, a collection of successor measures for the policies
\(\pi^\star_r\) that optimize the rewards \(r\). Now, we know something
else that's interesting about optimal policies:
</p>

\begin{align*}
\pi^\star_r(x) &\in \arg\max_aQ^{\pi^\star_r}(x, a)\\
&= \arg\max_aM^{\pi^\star_r}r(x, a).
\end{align*}

<p>
Note, however, that \(\pi^\star_r\) can be determined precisely by the
reward function \(r\), so let's say \(\pi^\star_r =
\mathsf{opt}(r)\). Equivalently, we now have
</p>

\begin{align*}
\pi^\star_r(x) \in \arg\max_a\bar{M}^rr(x, a)
\end{align*}

<p>
where \(\bar{M}^r = M^{\mathsf{opt}(r)}\). So, one way to learn
\(\bar{M}\) is to randomly sample a reward function \(r\) from some
prior, and then train \(\bar{M}^r\) with a TD update (see
e.g. <a href="https://arxiv.org/pdf/2101.07123.pdf">algorithms for learning fixed-policy SMs</a>) by using the greedy
action with respect to \(\bar{M}^rr\) in the bootstrap target. This
does literally amount to learning a reward-function-conditioned SM
with a greedy bootstrap target. Also, this is roughly what
the FB algorithm is doing in principle.
</p>
</div>

<div id="outline-container-orgdf54db7" class="outline-4">
<h4 id="orgdf54db7">The Missing Piece: Task Embeddings</h4>
<div class="outline-text-4" id="text-orgdf54db7">
<p>
So why not stop there? To my understanding, the problem is that
conditioning a function approximator on a <i>reward function</i> is
nontrivial. To begin with, you cannot even represent a reward function
exactly (it lives in an infinite-dimensional space
generally). Moreover, the product \(\bar{M}^rr\) would be
intractable to compute, as it would involve integrating over the state
space. The brilliance of the FB algorithm is the realization that by
<b>embedding the reward functions</b> into a finite dimensional space in a
special way, both
problems are simultaneously resolved. The idea is the
following. Assume \(\bar{M}^r\) has a low-rank factorization (at
least approximately) as \(\bar{M}^r(\cdot\mid x, a) = \bar{F}^r(x, a)^\top
\bar{B}(\cdot)\), where \(\bar{F}^r, \bar{B}^r\) have
range \(\mathbf{R}^d\). Note that \(\bar{B}\) does not depend on \(r\)
&#x2013; the idea here is that we want \(\bar{B}\) to act as a "reward
function encoder". It should also be noted that this factorization is
not actually that restrictive: for large enough \(d\), such a factorization
will exist (in the extreme case for arbitrarily large \(d\), we just
have \(B = \mathsf{Id}\) which is reward-independent). Under this model, optimal policies are
characterized by
</p>

\begin{align*}
\pi^\star_r(x) &\in \arg\max_{a}\bar{F}^r(x, a)^\top\bar{B}r\\
&= \arg\max_a\bar{F}^r(x, a)^\top z
\end{align*}

<p>
where \(z := \int_{\mathcal{X}}r(x')B(\mathrm{d}x')\in\mathbf{R}^d\). But now,
the greedy action depends only on \(z\)! Consequently, we can index
optimal policies and the \(\bar{F}\) factor by the "task
embeddings" \(z\in\mathbf{R}^d\). This looks like the following:
</p>

\begin{align*}
\begin{cases}
\pi_z(x) \in \arg\max_a F^z(x, a)^\top z\\
z = \int_{\mathcal{X}} r(x')B(\mathrm{d}x')\\
F^z(x, a)^\top B(\cdot) = M^{\pi_z}(\cdot\mid x, a)
\end{cases}
\end{align*}

<p>
Notably, we now can easily represent \(F, B\) with function
approximators (their inputs are now all finite-dimensional objects).
The paper shows some conditions on when such a
factorization exists (and provides error bounds in the case where the
factorization is only approximate). But the important lesson here, at
least to me, is that FB innovates by compressing the space of reward
functions in a clever way.
</p>

<p>
Now, given a learned FB representation and an arbitrary reward
function \(r\):
</p>

<ol class="org-ol">
<li>Infer the task embedding \(z = \int_{\mathcal{X}}
   r(x')B(\mathrm{d}x')\). While this is still an intractable integral,
we can approximate it by sampling. Or when \(r\) is the indicator for
a given state \(x^\star\) (like in goal-conditioned RL), \(z =
   B(\mathrm{d}x')\).</li>
<li>Exectute the policy \(\pi_z(x)\in\arg\max_aF^z(x, a)^\top z\).</li>
<li>Profit.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org6318e03" class="outline-3">
<h3 id="org6318e03">The Successor Measure</h3>
<div class="outline-text-3" id="text-org6318e03">
<p>
<a id="orgf903f97"></a>
The <i>successor measure</i> (SM) is a term that I believe was coined by
Leonard Blier, Corentin Tallec, and Yann Olivier in an <a href="https://arxiv.org/abs/2101.07123">excellent
manuscript</a> from 2021, which generalizes the successor representation
to measurable state spaces. For an MDP with transition kernel \(P\) and
a policy \(\pi\), the
successor measures is a measure on the state space conditioned on a
source state and action, defined as
</p>

\begin{align*}
M^\pi(\cdot\mid x, a) = \sum_{t\geq 0}\gamma^t\Pr_\pi(X_t\in\cdot\mid X_0 = x,\ A_0 = a)
\end{align*}

<p>
where \(\Pr_\pi\) is the probability measure over trajectories where
\(A_t\sim\pi(\cdot X_t)\) and \(X_{t+1}\sim \int P(\cdot\mid x,
a)\pi(\mathrm{d}a\mid x)\). Notably, it is readily verified
that \(M^\pi(\mathcal{X}\mid x, a) = (1-\gamma)^{-1}\), so \(M^\pi\) is a
finite measure for any source state-action pair. As such, it acts as a
linear operator on the space of bounded measurable functions in the
usual way,
</p>

\begin{align*}
(M^\pi f)(x, a) = \int_{\mathcal{X}}f(x')M^\pi(\mathrm{d}x'\mid x, a).
\end{align*}

<p>
But most notably, this linear operation has a most meaningful
interpretation in RL. Famously, it maps reward functions to
action-value functions,
</p>

\begin{align*}
M^\pi r = Q^\pi
\end{align*}

<p>
for any bounded and measurable reward function \(r\), so the successor
measure can be used as a device to infer the action-value function for
just about any reward function.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Harley Wiltzer</p>
<p class="date">Created: 2025-01-18 Sat 20:39</p>
</div>
</body>
</html>
